#pragma once

#include <Windows.h>

#define Uint2B unsigned short
#define Uint4B unsigned int
#define Uint8B unsigned long long
#define UChar unsigned char





#define _INTERLOCK_SEQ unsigned long 

#pragma pack(1)

#define _HEAP_LFH_MEM_POLICIES int

#define _HEAP_BUCKET_COUNTERS	unsigned __int64




/*

struct _HEAP_LOCAL_SEGMENT_INFO {
    char* LocalData;					        //0
    _HEAP_SUBSEGMENT* ActiveSubsegment;		    //8
    _HEAP_SUBSEGMENT* CachedItems[16];			//0x10
    _SLIST_HEADER SListHeader;						//0x90
    _HEAP_BUCKET_COUNTERS Counters;      	    //0xa0
    Uint4B  LastOpSequence;								//0x0a8 
    Uint2B BucketIndex;      						//0x0ac
    Uint2B LastUsed;         						//0x0ae 
    Uint2B NoThrashCount;    						//0x0b0 
};

struct _HEAP_SUBSEGMENT {
    _HEAP_LOCAL_SEGMENT_INFO* LocalInfo;
    _HEAP_USERDATA_HEADER* UserBlocks;
    _SLIST_HEADER DelayFreeList;					//0x10
    _INTERLOCK_SEQ AggregateExchg;					//0x20
    Uint2B BlockSize;								//0x24
    Uint2B Flags;									//0x26
    Uint2B BlockCount;								//0x28
    UChar SizeIndex;								//0x2a
    UChar AffinityIndex;							//0x2b
    Uint4B Lock;									//0x2c
    _SINGLE_LIST_ENTRY SFreeListEntry;				//0x30
};


//0x38 bytes (sizeof)
struct _HEAP_LIST_LOOKUP
{
    struct _HEAP_LIST_LOOKUP* ExtendedLookup;                               //0x0
    ULONG ArraySize;                                                        //0x8
    ULONG ExtraItem;                                                        //0xc
    ULONG ItemCount;                                                        //0x10
    ULONG OutOfRangeItems;                                                  //0x14
    ULONG BaseIndex;                                                        //0x18
    struct _LIST_ENTRY* ListHead;                                           //0x20
    ULONG* ListsInUseUlong;                                                 //0x28
    struct _LIST_ENTRY** ListHints;                                         //0x30
};



struct _RTL_BITMAP_EX {
    __int64 SizeOfBitMap;
    void* Buffer;
};

struct _HEAP_USERDATA_HEADER {
    _SINGLE_LIST_ENTRY* SFreeListEntry;	//0
    _HEAP_SUBSEGMENT* SubSegment;		//0
    void* Reserved;						//8
    UChar SizeIndex;					//0x10
    UChar GuardPagePresent;				//0x11
    Uint2B PaddingBytes;				//0x12
    Uint4B Signature;					//0x14
    int EncodedOffsets;	                //0x18
    _RTL_BITMAP_EX BusyBitmap;				//0x20
    Uint8B BitmapData[1];					//0x30
};

struct  _HEAP_BUCKET
{
    Uint2B BlockUnits;
    UChar SizeIndex;
    char UseAffinity : 1;
    char DebugFlags : 2;
    char Flags : 5;
};

struct _LFH_HEAP {
    _RTL_SRWLOCK Lock;				//0
    _LIST_ENTRY SubSegmentZones; 	//8
    void* Heap;						//0x18
    void* NextSegmentInfoArrayAddress;		//0x20
    VOID* FirstUncommittedAddress;			//0x28
    VOID* ReservedAddressLimit;				//30
    Uint4B SegmentCreate;					//0X38
    Uint4B SegmentDelete;					//0x3c
    Uint4B MinimumCacheDepth;				//0x40
    Uint4B CacheShiftThreshold;				//0x44
    Uint8B SizeInCache; 					//0x48
    char* RunInfo[2];					//0x50    
    char UserBlockCache[576]; 	        //0x60 
    _HEAP_LFH_MEM_POLICIES  MemoryPolicies;			//0x2a0 
    _HEAP_BUCKET Buckets[129];						//0x2a4 
    _HEAP_LOCAL_SEGMENT_INFO  SegmentInfoArrays[129];			//0x4a8 
    _HEAP_LOCAL_SEGMENT_INFO	AffinitizedInfoArrays[129];		//0x8b0 
    void* SegmentAllocator;							//0xcb8
    char* LocalData[1];								    //0xcc0 
};



*/




//0x10 bytes (sizeof)
struct _HEAP_ENTRY
{
    union
    {
        struct _HEAP_UNPACKED_ENTRY                          //0x0       
        {
            VOID* PreviousBlockPrivateData;                                 //0x0
            union
            {
                struct
                {
                    USHORT Size;                                            //0x8
                    UCHAR Flags;                                            //0xa
                    UCHAR SmallTagIndex;                                    //0xb
                };
                struct
                {
                    ULONG SubSegmentCode;                                   //0x8
                    USHORT PreviousSize;                                    //0xc
                    union
                    {
                        UCHAR SegmentOffset;                                //0xe
                        UCHAR LFHFlags;                                     //0xe
                    };
                    UCHAR UnusedBytes;                                      //0xf
                };
                ULONGLONG CompactHeader;                                    //0x8
            };
        }UnpackedEntry;

        struct _HEAP_EXTENDED_ENTRY                        //0x0
        {
            VOID* Reserved;                                                 //0x0
            union
            {
                struct
                {
                    USHORT FunctionIndex;                                   //0x8
                    USHORT ContextValue;                                    //0xa
                };
                ULONG InterceptorValue;                                     //0x8
            };
            USHORT UnusedBytesLength;                                       //0xc
            UCHAR EntryOffset;                                              //0xe
            UCHAR ExtendedBlockSignature;                                   //0xf
        }ExtendedEntry;

        struct
        {
            VOID* ReservedForAlignment;                                     //0x0
            union
            {
                struct
                {
                    ULONG Code1;                                            //0x8
                    union
                    {
                        struct
                        {
                            USHORT Code2;                                   //0xc
                            UCHAR Code3;                                    //0xe
                            UCHAR Code4;                                    //0xf
                        };
                        ULONG Code234;                                      //0xc
                    };
                };
                ULONGLONG AgregateCode;                                     //0x8
            };
        };
    };
};

#define Uchar unsigned char

struct _HEAP_ENTRY_inused {
    void* PreviousBlockPrivateData;					//0x0
    Uint2B Size;										//0x8
    UChar Flags;										//0xa
    UChar SmallTagIndex;								//0xb
    Uint2B PreviousSize;								//0xc
    UChar SegmentOffset;								//0xe
    UChar Unusedbyte;									//0xf
    UChar UserData[];									//0x10
};



struct _HEAP_ENTRY_freed {
    void* PreviousBlockPrivateData;					//0x0
    Uint2B Size;										//0x8
    Uchar Flags;										//0xa
    Uchar SmallTagIndex;								//0xb
    Uint2B PreviousSize;								//0xc
    Uchar SegmentOffset;								//0xe
    Uchar Unusedbyte;									//0xf
    struct _LIST_ENTRY* Flink;							//0x10
    struct _LIST_ENTRY* Blink;							//0x18
};





//0x10 bytes (sizeof)
struct _HEAP_ENTRY_EXTRA
{
    union
    {
        struct
        {
            USHORT AllocatorBackTraceIndex;                                 //0x0
            USHORT TagIndex;                                                //0x2
            ULONGLONG Settable;                                             //0x8
        };
        struct
        {
            ULONGLONG ZeroInit;                                             //0x0
            ULONGLONG ZeroInit1;                                            //0x8
        };
    };
};


//0x40 bytes (sizeof)
struct _HEAP_VIRTUAL_ALLOC_ENTRY
{
    struct _LIST_ENTRY Entry;                                               //0x0
    struct _HEAP_ENTRY_EXTRA ExtraStuff;                                    //0x10
    ULONGLONG CommitSize;                                                   //0x20
    ULONGLONG ReserveSize;                                                  //0x28
    struct _HEAP_ENTRY BusyBlock;                                           //0x30
};
#pragma pack()